Revit 2027 API
BuiltInFailures.GeneralFailures.SlantedColumnEndsHaveSameHeight Property
 The first click elevation (combination of level and offset) cannot be equal to the second click elevation (combination of level and offset).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlantedColumnEndsHaveSameHeight { get; }
Public Shared ReadOnly Property SlantedColumnEndsHaveSameHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlantedColumnEndsHaveSameHeight {
	FailureDefinitionId^ get ();
}
static member SlantedColumnEndsHaveSameHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace